sorosaulong-ux/gd32-test-project/Library/gd32a7xx_exti.h
/* EXTI_EVEN0 */
#define EXTI_EVEN0_EVEN0              BIT(0)                   /*!< event from line 0 */
#define EXTI_EVEN0_EVEN1              BIT(1)                   /*!< event from line 1 */
#define EXTI_EVEN0_EVEN2              BIT(2)                   /*!< event from line 2 */
#define EXTI_EVEN0_EVEN3              BIT(3)                   /*!< event from line 3 */
#define EXTI_EVEN0_EVEN4              BIT(4)                   /*!< event from line 4 */
#define EXTI_EVEN0_EVEN5              BIT(5)                   /*!< event from line 5 */
#define EXTI_EVEN0_EVEN6              BIT(6)                   /*!< event from line 6 */
#define EXTI_EVEN0_EVEN7              BIT(7)                   /*!< event from line 7 */
#define EXTI_EVEN0_EVEN8              BIT(8)                   /*!< event from line 8 */
#define EXTI_EVEN0_EVEN9              BIT(9)                   /*!< event from line 9 */
#define EXTI_EVEN0_EVEN10             BIT(10)                  /*!< event from line 10 */
#define EXTI_EVEN0_EVEN11             BIT(11)                  /*!< event from line 11 */
#define EXTI_EVEN0_EVEN12             BIT(12)                  /*!< event from line 12 */
#define EXTI_EVEN0_EVEN13             BIT(13)                  /*!< event from line 13 */
#define EXTI_EVEN0_EVEN14             BIT(14)                  /*!< event from line 14 */
#define EXTI_EVEN0_EVEN15             BIT(15)                  /*!< event from line 15 */
#define EXTI_EVEN0_EVEN16             BIT(16)                  /*!< event from line 16 */
#define EXTI_EVEN0_EVEN17             BIT(17)                  /*!< event from line 17 */
#define EXTI_EVEN0_EVEN18             BIT(18)                  /*!< event from line 18 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_EVEN0_EVEN19             BIT(19)                  /*!< event from line 19 */
#define EXTI_EVEN0_EVEN20             BIT(20)                  /*!< event from line 20 */
#define EXTI_EVEN0_EVEN21             BIT(21)                  /*!< event from line 21 */
#define EXTI_EVEN0_EVEN22             BIT(22)                  /*!< event from line 22 */
#define EXTI_EVEN0_EVEN23             BIT(23)                  /*!< event from line 23 */
#define EXTI_EVEN0_EVEN24             BIT(24)                  /*!< event from line 24 */
#define EXTI_EVEN0_EVEN25             BIT(25)                  /*!< event from line 25 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_EVEN0_EVEN26             BIT(26)                  /*!< event from line 26 */
#define EXTI_EVEN0_EVEN27             BIT(27)                  /*!< event from line 27 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_EVEN0_EVEN28             BIT(28)                  /*!< event from line 28 */
#define EXTI_EVEN0_EVEN29             BIT(29)                  /*!< event from line 29 */
#define EXTI_EVEN0_EVEN30             BIT(30)                  /*!< event from line 30 */
#define EXTI_EVEN0_EVEN31             BIT(31)                  /*!< event from line 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* EXTI_RTEN0 */
#define EXTI_RTEN0_RTEN0              BIT(0)                   /*!< rising edge from line 0 */
#define EXTI_RTEN0_RTEN1              BIT(1)                   /*!< rising edge from line 1 */
#define EXTI_RTEN0_RTEN2              BIT(2)                   /*!< rising edge from line 2 */
#define EXTI_RTEN0_RTEN3              BIT(3)                   /*!< rising edge from line 3 */
#define EXTI_RTEN0_RTEN4              BIT(4)                   /*!< rising edge from line 4 */
#define EXTI_RTEN0_RTEN5              BIT(5)                   /*!< rising edge from line 5 */
#define EXTI_RTEN0_RTEN6              BIT(6)                   /*!< rising edge from line 6 */
#define EXTI_RTEN0_RTEN7              BIT(7)                   /*!< rising edge from line 7 */
#define EXTI_RTEN0_RTEN8              BIT(8)                   /*!< rising edge from line 8 */
#define EXTI_RTEN0_RTEN9              BIT(9)                   /*!< rising edge from line 9 */
#define EXTI_RTEN0_RTEN10             BIT(10)                  /*!< rising edge from line 10 */
#define EXTI_RTEN0_RTEN11             BIT(11)                  /*!< rising edge from line 11 */
#define EXTI_RTEN0_RTEN12             BIT(12)                  /*!< rising edge from line 12 */
#define EXTI_RTEN0_RTEN13             BIT(13)                  /*!< rising edge from line 13 */
#define EXTI_RTEN0_RTEN14             BIT(14)                  /*!< rising edge from line 14 */
#define EXTI_RTEN0_RTEN15             BIT(15)                  /*!< rising edge from line 15 */
#define EXTI_RTEN0_RTEN16             BIT(16)                  /*!< rising edge from line 16 */
#define EXTI_RTEN0_RTEN17             BIT(17)                  /*!< rising edge from line 17 */
#define EXTI_RTEN0_RTEN18             BIT(18)                  /*!< rising edge from line 18 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_RTEN0_RTEN19             BIT(19)                  /*!< rising edge from line 19 */
#define EXTI_RTEN0_RTEN20             BIT(20)                  /*!< rising edge from line 20 */
#define EXTI_RTEN0_RTEN21             BIT(21)                  /*!< rising edge from line 21 */
#define EXTI_RTEN0_RTEN22             BIT(22)                  /*!< rising edge from line 22 */
#define EXTI_RTEN0_RTEN23             BIT(23)                  /*!< rising edge from line 23 */
#define EXTI_RTEN0_RTEN24             BIT(24)                  /*!< rising edge from line 24 */
#define EXTI_RTEN0_RTEN25             BIT(25)                  /*!< rising edge from line 25 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_RTEN0_RTEN26             BIT(26)                  /*!< rising edge from line 26 */
#define EXTI_RTEN0_RTEN27             BIT(27)                  /*!< rising edge from line 27 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_RTEN0_RTEN28             BIT(28)                  /*!< rising edge from line 28 */
#define EXTI_RTEN0_RTEN29             BIT(29)                  /*!< rising edge from line 29 */
#define EXTI_RTEN0_RTEN30             BIT(30)                  /*!< rising edge from line 30 */
#define EXTI_RTEN0_RTEN31             BIT(31)                  /*!< rising edge from line 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* EXTI_FTEN0 */
#define EXTI_FTEN0_FTEN0              BIT(0)                   /*!< falling edge from line 0 */
#define EXTI_FTEN0_FTEN1              BIT(1)                   /*!< falling edge from line 1 */
#define EXTI_FTEN0_FTEN2              BIT(2)                   /*!< falling edge from line 2 */
#define EXTI_FTEN0_FTEN3              BIT(3)                   /*!< falling edge from line 3 */
#define EXTI_FTEN0_FTEN4              BIT(4)                   /*!< falling edge from line 4 */
#define EXTI_FTEN0_FTEN5              BIT(5)                   /*!< falling edge from line 5 */
#define EXTI_FTEN0_FTEN6              BIT(6)                   /*!< falling edge from line 6 */
#define EXTI_FTEN0_FTEN7              BIT(7)                   /*!< falling edge from line 7 */
#define EXTI_FTEN0_FTEN8              BIT(8)                   /*!< falling edge from line 8 */
#define EXTI_FTEN0_FTEN9              BIT(9)                   /*!< falling edge from line 9 */
#define EXTI_FTEN0_FTEN10             BIT(10)                  /*!< falling edge from line 10 */
#define EXTI_FTEN0_FTEN11             BIT(11)                  /*!< falling edge from line 11 */
#define EXTI_FTEN0_FTEN12             BIT(12)                  /*!< falling edge from line 12 */
#define EXTI_FTEN0_FTEN13             BIT(13)                  /*!< falling edge from line 13 */
#define EXTI_FTEN0_FTEN14             BIT(14)                  /*!< falling edge from line 14 */
#define EXTI_FTEN0_FTEN15             BIT(15)                  /*!< falling edge from line 15 */
#define EXTI_FTEN0_FTEN16             BIT(16)                  /*!< falling edge from line 16 */
#define EXTI_FTEN0_FTEN17             BIT(17)                  /*!< falling edge from line 17 */
#define EXTI_FTEN0_FTEN18             BIT(18)                  /*!< falling edge from line 18 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_FTEN0_FTEN19             BIT(19)                  /*!< falling edge from line 19 */
#define EXTI_FTEN0_FTEN20             BIT(20)                  /*!< falling edge from line 20 */
#define EXTI_FTEN0_FTEN21             BIT(21)                  /*!< falling edge from line 21 */
#define EXTI_FTEN0_FTEN22             BIT(22)                  /*!< falling edge from line 22 */
#define EXTI_FTEN0_FTEN23             BIT(23)                  /*!< falling edge from line 23 */
#define EXTI_FTEN0_FTEN24             BIT(24)                  /*!< falling edge from line 24 */
#define EXTI_FTEN0_FTEN25             BIT(25)                  /*!< falling edge from line 25 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_FTEN0_FTEN26             BIT(26)                  /*!< falling edge from line 26 */
#define EXTI_FTEN0_FTEN27             BIT(27)                  /*!< falling edge from line 27 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_FTEN0_FTEN28             BIT(28)                  /*!< falling edge from line 28 */
#define EXTI_FTEN0_FTEN29             BIT(29)                  /*!< falling edge from line 29 */
#define EXTI_FTEN0_FTEN30             BIT(30)                  /*!< falling edge from line 30 */
#define EXTI_FTEN0_FTEN31             BIT(31)                  /*!< falling edge from line 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* EXTI_SWIEV0 */
#define EXTI_SWIEV0_SWIEV0            BIT(0)                   /*!< software interrupt/event request from line 0 */
#define EXTI_SWIEV0_SWIEV1            BIT(1)                   /*!< software interrupt/event request from line 1 */
#define EXTI_SWIEV0_SWIEV2            BIT(2)                   /*!< software interrupt/event request from line 2 */
#define EXTI_SWIEV0_SWIEV3            BIT(3)                   /*!< software interrupt/event request from line 3 */
#define EXTI_SWIEV0_SWIEV4            BIT(4)                   /*!< software interrupt/event request from line 4 */
#define EXTI_SWIEV0_SWIEV5            BIT(5)                   /*!< software interrupt/event request from line 5 */
#define EXTI_SWIEV0_SWIEV6            BIT(6)                   /*!< software interrupt/event request from line 6 */
#define EXTI_SWIEV0_SWIEV7            BIT(7)                   /*!< software interrupt/event request from line 7 */
#define EXTI_SWIEV0_SWIEV8            BIT(8)                   /*!< software interrupt/event request from line 8 */
#define EXTI_SWIEV0_SWIEV9            BIT(9)                   /*!< software interrupt/event request from line 9 */
#define EXTI_SWIEV0_SWIEV10           BIT(10)                  /*!< software interrupt/event request from line 10 */
#define EXTI_SWIEV0_SWIEV11           BIT(11)                  /*!< software interrupt/event request from line 11 */
#define EXTI_SWIEV0_SWIEV12           BIT(12)                  /*!< software interrupt/event request from line 12 */
#define EXTI_SWIEV0_SWIEV13           BIT(13)                  /*!< software interrupt/event request from line 13 */
#define EXTI_SWIEV0_SWIEV14           BIT(14)                  /*!< software interrupt/event request from line 14 */
#define EXTI_SWIEV0_SWIEV15           BIT(15)                  /*!< software interrupt/event request from line 15 */
#define EXTI_SWIEV0_SWIEV16           BIT(16)                  /*!< software interrupt/event request from line 16 */
#define EXTI_SWIEV0_SWIEV17           BIT(17)                  /*!< software interrupt/event request from line 17 */
#define EXTI_SWIEV0_SWIEV18           BIT(18)                  /*!< software interrupt/event request from line 18 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_SWIEV0_SWIEV19           BIT(19)                  /*!< software interrupt/event request from line 19 */
#define EXTI_SWIEV0_SWIEV20           BIT(20)                  /*!< software interrupt/event request from line 20 */
#define EXTI_SWIEV0_SWIEV21           BIT(21)                  /*!< software interrupt/event request from line 21 */
#define EXTI_SWIEV0_SWIEV22           BIT(22)                  /*!< software interrupt/event request from line 22 */
#define EXTI_SWIEV0_SWIEV23           BIT(23)                  /*!< software interrupt/event request from line 23 */
#define EXTI_SWIEV0_SWIEV24           BIT(24)                  /*!< software interrupt/event request from line 24 */
#define EXTI_SWIEV0_SWIEV25           BIT(25)                  /*!< software interrupt/event request from line 25 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_SWIEV0_SWIEV26           BIT(26)                  /*!< software interrupt/event request from line 26 */
#define EXTI_SWIEV0_SWIEV27           BIT(27)                  /*!< software interrupt/event request from line 27 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_SWIEV0_SWIEV28           BIT(28)                  /*!< software interrupt/event request from line 28 */
#define EXTI_SWIEV0_SWIEV29           BIT(29)                  /*!< software interrupt/event request from line 29 */
#define EXTI_SWIEV0_SWIEV30           BIT(30)                  /*!< software interrupt/event request from line 30 */
#define EXTI_SWIEV0_SWIEV31           BIT(31)                  /*!< software interrupt/event request from line 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* EXTI_PD0 */
#define EXTI_PD0_PD0                  BIT(0)                   /*!< interrupt/event pending status from line 0 */
#define EXTI_PD0_PD1                  BIT(1)                   /*!< interrupt/event pending status from line 1 */
#define EXTI_PD0_PD2                  BIT(2)                   /*!< interrupt/event pending status from line 2 */
#define EXTI_PD0_PD3                  BIT(3)                   /*!< interrupt/event pending status from line 3 */
#define EXTI_PD0_PD4                  BIT(4)                   /*!< interrupt/event pending status from line 4 */
#define EXTI_PD0_PD5                  BIT(5)                   /*!< interrupt/event pending status from line 5 */
#define EXTI_PD0_PD6                  BIT(6)                   /*!< interrupt/event pending status from line 6 */
#define EXTI_PD0_PD7                  BIT(7)                   /*!< interrupt/event pending status from line 7 */
#define EXTI_PD0_PD8                  BIT(8)                   /*!< interrupt/event pending status from line 8 */
#define EXTI_PD0_PD9                  BIT(9)                   /*!< interrupt/event pending status from line 9 */
#define EXTI_PD0_PD10                 BIT(10)                  /*!< interrupt/event pending status from line 10 */
#define EXTI_PD0_PD11                 BIT(11)                  /*!< interrupt/event pending status from line 11 */
#define EXTI_PD0_PD12                 BIT(12)                  /*!< interrupt/event pending status from line 12 */
#define EXTI_PD0_PD13                 BIT(13)                  /*!< interrupt/event pending status from line 13 */
#define EXTI_PD0_PD14                 BIT(14)                  /*!< interrupt/event pending status from line 14 */
#define EXTI_PD0_PD15                 BIT(15)                  /*!< interrupt/event pending status from line 15 */
#define EXTI_PD0_PD16                 BIT(16)                  /*!< interrupt/event pending status from line 16 */
#define EXTI_PD0_PD17                 BIT(17)                  /*!< interrupt/event pending status from line 17 */
#define EXTI_PD0_PD18                 BIT(18)                  /*!< interrupt/event pending status from line 18 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_PD0_PD19                 BIT(19)                  /*!< interrupt/event pending status from line 19 */
#define EXTI_PD0_PD20                 BIT(20)                  /*!< interrupt/event pending status from line 20 */
#define EXTI_PD0_PD21                 BIT(21)                  /*!< interrupt/event pending status from line 21 */
#define EXTI_PD0_PD22                 BIT(22)                  /*!< interrupt/event pending status from line 22 */
#define EXTI_PD0_PD23                 BIT(23)                  /*!< interrupt/event pending status from line 23 */
#define EXTI_PD0_PD24                 BIT(24)                  /*!< interrupt/event pending status from line 24 */
#define EXTI_PD0_PD25                 BIT(25)                  /*!< interrupt/event pending status from line 25 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_PD0_PD26                 BIT(26)                  /*!< interrupt/event pending status from line 26 */
#define EXTI_PD0_PD27                 BIT(27)                  /*!< interrupt/event pending status from line 27 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_PD0_PD28                 BIT(28)                  /*!< interrupt/event pending status from line 28 */
#define EXTI_PD0_PD29                 BIT(29)                  /*!< interrupt/event pending status from line 29 */
#define EXTI_PD0_PD30                 BIT(30)                  /*!< interrupt/event pending status from line 30 */
#define EXTI_PD0_PD31                 BIT(31)                  /*!< interrupt/event pending status from line 31 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

