sorosaulong-ux/gd32-test-project/Library/gd32a7xx_exti.h
/* EXTI_INTEN1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_INTEN1_INTEN32            BIT(0)                  /*!< interrupt from line 32 */
#define EXTI_INTEN1_INTEN33            BIT(1)                  /*!< interrupt from line 33 */
#define EXTI_INTEN1_INTEN34            BIT(2)                  /*!< interrupt from line 34 */
#define EXTI_INTEN1_INTEN35            BIT(3)                  /*!< interrupt from line 35 */
#define EXTI_INTEN1_INTEN36            BIT(4)                  /*!< interrupt from line 36 */
#define EXTI_INTEN1_INTEN37            BIT(5)                  /*!< interrupt from line 37 */
#define EXTI_INTEN1_INTEN38            BIT(6)                  /*!< interrupt from line 38 */
#define EXTI_INTEN1_INTEN39            BIT(7)                  /*!< interrupt from line 39 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_INTEN1_INTEN40            BIT(8)                  /*!< interrupt from line 40 */
#define EXTI_INTEN1_INTEN41            BIT(9)                  /*!< interrupt from line 41 */

/* EXTI_EVEN1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_EVEN1_EVEN32              BIT(0)                  /*!< event from line 32 */
#define EXTI_EVEN1_EVEN33              BIT(1)                  /*!< event from line 33 */
#define EXTI_EVEN1_EVEN34              BIT(2)                  /*!< event from line 34 */
#define EXTI_EVEN1_EVEN35              BIT(3)                  /*!< event from line 35 */
#define EXTI_EVEN1_EVEN36              BIT(4)                  /*!< event from line 36 */
#define EXTI_EVEN1_EVEN37              BIT(5)                  /*!< event from line 37 */
#define EXTI_EVEN1_EVEN38              BIT(6)                  /*!< event from line 38 */
#define EXTI_EVEN1_EVEN39              BIT(7)                  /*!< event from line 39 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_EVEN1_EVEN40              BIT(8)                  /*!< event from line 40 */
#define EXTI_EVEN1_EVEN41              BIT(9)                  /*!< event from line 41 */

/* EXTI_RTEN1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_RTEN1_RTEN32              BIT(0)                  /*!< rising edge from line 32 */
#define EXTI_RTEN1_RTEN33              BIT(1)                  /*!< rising edge from line 33 */
#define EXTI_RTEN1_RTEN34              BIT(2)                  /*!< rising edge from line 34 */
#define EXTI_RTEN1_RTEN35              BIT(3)                  /*!< rising edge from line 35 */
#define EXTI_RTEN1_RTEN36              BIT(4)                  /*!< rising edge from line 36 */
#define EXTI_RTEN1_RTEN37              BIT(5)                  /*!< rising edge from line 37 */
#define EXTI_RTEN1_RTEN38              BIT(6)                  /*!< rising edge from line 38 */
#define EXTI_RTEN1_RTEN39              BIT(7)                  /*!< rising edge from line 39 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_RTEN1_RTEN40              BIT(8)                  /*!< rising edge from line 40 */
#define EXTI_RTEN1_RTEN41              BIT(9)                  /*!< rising edge from line 41 */

/* EXTI_FTEN1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_FTEN1_FTEN32              BIT(0)                  /*!< falling edge from line 32 */
#define EXTI_FTEN1_FTEN33              BIT(1)                  /*!< falling edge from line 33 */
#define EXTI_FTEN1_FTEN34              BIT(2)                  /*!< falling edge from line 34 */
#define EXTI_FTEN1_FTEN35              BIT(3)                  /*!< falling edge from line 35 */
#define EXTI_FTEN1_FTEN36              BIT(4)                  /*!< falling edge from line 36 */
#define EXTI_FTEN1_FTEN37              BIT(5)                  /*!< falling edge from line 37 */
#define EXTI_FTEN1_FTEN38              BIT(6)                  /*!< falling edge from line 38 */
#define EXTI_FTEN1_FTEN39              BIT(7)                  /*!< falling edge from line 39 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_FTEN1_FTEN40              BIT(8)                  /*!< falling edge from line 40 */
#define EXTI_FTEN1_FTEN41              BIT(9)                  /*!< falling edge from line 41 */

/* EXTI_SWIEV1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_SWIEV1_SWIEV32            BIT(0)                  /*!< software interrupt/event request from line 32 */
#define EXTI_SWIEV1_SWIEV33            BIT(1)                  /*!< software interrupt/event request from line 33 */
#define EXTI_SWIEV1_SWIEV34            BIT(2)                  /*!< software interrupt/event request from line 34 */
#define EXTI_SWIEV1_SWIEV35            BIT(3)                  /*!< software interrupt/event request from line 35 */
#define EXTI_SWIEV1_SWIEV36            BIT(4)                  /*!< software interrupt/event request from line 36 */
#define EXTI_SWIEV1_SWIEV37            BIT(5)                  /*!< software interrupt/event request from line 37 */
#define EXTI_SWIEV1_SWIEV38            BIT(6)                  /*!< software interrupt/event request from line 38 */
#define EXTI_SWIEV1_SWIEV39            BIT(7)                  /*!< software interrupt/event request from line 39 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_SWIEV1_SWIEV40            BIT(8)                  /*!< software interrupt/event request from line 40 */
#define EXTI_SWIEV1_SWIEV41            BIT(9)                  /*!< software interrupt/event request from line 41 */

/* EXTI_PD1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define EXTI_PD1_PD32                  BIT(0)                  /*!< interrupt/event pending status from line 32 */
#define EXTI_PD1_PD33                  BIT(1)                  /*!< interrupt/event pending status from line 33 */
#define EXTI_PD1_PD34                  BIT(2)                  /*!< interrupt/event pending status from line 34 */
#define EXTI_PD1_PD35                  BIT(3)                  /*!< interrupt/event pending status from line 35 */
#define EXTI_PD1_PD36                  BIT(4)                  /*!< interrupt/event pending status from line 36 */
#define EXTI_PD1_PD37                  BIT(5)                  /*!< interrupt/event pending status from line 37 */
#define EXTI_PD1_PD38                  BIT(6)                  /*!< interrupt/event pending status from line 38 */
#define EXTI_PD1_PD39                  BIT(7)                  /*!< interrupt/event pending status from line 39 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define EXTI_PD1_PD40                  BIT(8)                  /*!< interrupt/event pending status from line 40 */
#define EXTI_PD1_PD41                  BIT(9)                  /*!< interrupt/event pending status from line 41 */

/* EXTI_INTEN2 */
#define EXTI_INTEN2_INTEN42            BIT(0)                   /*!< interrupt from line 42 */
#define EXTI_INTEN2_INTEN43            BIT(1)                   /*!< interrupt from line 43 */
#define EXTI_INTEN2_INTEN44            BIT(2)                   /*!< interrupt from line 44 */
#define EXTI_INTEN2_INTEN45            BIT(3)                   /*!< interrupt from line 45 */
#define EXTI_INTEN2_INTEN46            BIT(4)                   /*!< interrupt from line 46 */
#define EXTI_INTEN2_INTEN47            BIT(5)                   /*!< interrupt from line 47 */
#define EXTI_INTEN2_INTEN48            BIT(6)                   /*!< interrupt from line 48 */
#define EXTI_INTEN2_INTEN49            BIT(7)                   /*!< interrupt from line 49 */
#define EXTI_INTEN2_INTEN50            BIT(8)                   /*!< interrupt from line 50 */
#define EXTI_INTEN2_INTEN51            BIT(9)                   /*!< interrupt from line 51 */
#define EXTI_INTEN2_INTEN52            BIT(10)                  /*!< interrupt from line 52 */
#define EXTI_INTEN2_INTEN53            BIT(11)                  /*!< interrupt from line 53 */
#define EXTI_INTEN2_INTEN54            BIT(12)                  /*!< interrupt from line 54 */
#define EXTI_INTEN2_INTEN55            BIT(13)                  /*!< interrupt from line 55 */
#define EXTI_INTEN2_INTEN56            BIT(14)                  /*!< interrupt from line 56 */
#define EXTI_INTEN2_INTEN57            BIT(15)                  /*!< interrupt from line 57 */
#define EXTI_INTEN2_INTEN58            BIT(16)                  /*!< interrupt from line 58 */
#define EXTI_INTEN2_INTEN59            BIT(17)                  /*!< interrupt from line 59 */
#define EXTI_INTEN2_INTEN60            BIT(18)                  /*!< interrupt from line 60 */
#define EXTI_INTEN2_INTEN61            BIT(19)                  /*!< interrupt from line 61 */
#define EXTI_INTEN2_INTEN62            BIT(20)                  /*!< interrupt from line 62 */
#define EXTI_INTEN2_INTEN63            BIT(21)                  /*!< interrupt from line 63 */
#define EXTI_INTEN2_INTEN64            BIT(22)                  /*!< interrupt from line 64 */
#define EXTI_INTEN2_INTEN65            BIT(23)                  /*!< interrupt from line 65 */
#define EXTI_INTEN2_INTEN66            BIT(24)                  /*!< interrupt from line 66 */
#define EXTI_INTEN2_INTEN67            BIT(25)                  /*!< interrupt from line 67 */
#define EXTI_INTEN2_INTEN68            BIT(26)                  /*!< interrupt from line 68 */
#define EXTI_INTEN2_INTEN69            BIT(27)                  /*!< interrupt from line 69 */
#define EXTI_INTEN2_INTEN70            BIT(28)                  /*!< interrupt from line 70 */
#define EXTI_INTEN2_INTEN71            BIT(29)                  /*!< interrupt from line 71 */
#define EXTI_INTEN2_INTEN72            BIT(30)                  /*!< interrupt from line 72 */
#define EXTI_INTEN2_INTEN73            BIT(31)                  /*!< interrupt from line 73 */

/* EXTI_EVEN2 */
#define EXTI_EVEN2_EVEN42              BIT(0)                   /*!< event from line 42 */
#define EXTI_EVEN2_EVEN43              BIT(1)                   /*!< event from line 43 */
#define EXTI_EVEN2_EVEN44              BIT(2)                   /*!< event from line 44 */
#define EXTI_EVEN2_EVEN45              BIT(3)                   /*!< event from line 45 */
#define EXTI_EVEN2_EVEN46              BIT(4)                   /*!< event from line 46 */
#define EXTI_EVEN2_EVEN47              BIT(5)                   /*!< event from line 47 */
#define EXTI_EVEN2_EVEN48              BIT(6)                   /*!< event from line 48 */
#define EXTI_EVEN2_EVEN49              BIT(7)                   /*!< event from line 49 */
#define EXTI_EVEN2_EVEN50              BIT(8)                   /*!< event from line 50 */
#define EXTI_EVEN2_EVEN51              BIT(9)                   /*!< event from line 51 */
#define EXTI_EVEN2_EVEN52              BIT(10)                  /*!< event from line 52 */
#define EXTI_EVEN2_EVEN53              BIT(11)                  /*!< event from line 53 */
#define EXTI_EVEN2_EVEN54              BIT(12)                  /*!< event from line 54 */
#define EXTI_EVEN2_EVEN55              BIT(13)                  /*!< event from line 55 */
#define EXTI_EVEN2_EVEN56              BIT(14)                  /*!< event from line 56 */
#define EXTI_EVEN2_EVEN57              BIT(15)                  /*!< event from line 57 */
#define EXTI_EVEN2_EVEN58              BIT(16)                  /*!< event from line 58 */
#define EXTI_EVEN2_EVEN59              BIT(17)                  /*!< event from line 59 */
#define EXTI_EVEN2_EVEN60              BIT(18)                  /*!< event from line 60 */
#define EXTI_EVEN2_EVEN61              BIT(19)                  /*!< event from line 61 */
#define EXTI_EVEN2_EVEN62              BIT(20)                  /*!< event from line 62 */
#define EXTI_EVEN2_EVEN63              BIT(21)                  /*!< event from line 63 */
#define EXTI_EVEN2_EVEN64              BIT(22)                  /*!< event from line 64 */
#define EXTI_EVEN2_EVEN65              BIT(23)                  /*!< event from line 65 */
#define EXTI_EVEN2_EVEN66              BIT(24)                  /*!< event from line 66 */
#define EXTI_EVEN2_EVEN67              BIT(25)                  /*!< event from line 67 */
#define EXTI_EVEN2_EVEN68              BIT(26)                  /*!< event from line 68 */
#define EXTI_EVEN2_EVEN69              BIT(27)                  /*!< event from line 69 */
#define EXTI_EVEN2_EVEN70              BIT(28)                  /*!< event from line 70 */
#define EXTI_EVEN2_EVEN71              BIT(29)                  /*!< event from line 71 */
#define EXTI_EVEN2_EVEN72              BIT(30)                  /*!< event from line 72 */
#define EXTI_EVEN2_EVEN73              BIT(31)                  /*!< event from line 73 */

