sorosaulong-ux/gd32-test-project/Library/gd32a7xx_exti.h
/* EXTI_RTEN2 */
#define EXTI_RTEN2_RTEN42              BIT(0)                   /*!< rising edge from line 42 */
#define EXTI_RTEN2_RTEN43              BIT(1)                   /*!< rising edge from line 43 */
#define EXTI_RTEN2_RTEN44              BIT(2)                   /*!< rising edge from line 44 */
#define EXTI_RTEN2_RTEN45              BIT(3)                   /*!< rising edge from line 45 */
#define EXTI_RTEN2_RTEN46              BIT(4)                   /*!< rising edge from line 46 */
#define EXTI_RTEN2_RTEN47              BIT(5)                   /*!< rising edge from line 47 */
#define EXTI_RTEN2_RTEN48              BIT(6)                   /*!< rising edge from line 48 */
#define EXTI_RTEN2_RTEN49              BIT(7)                   /*!< rising edge from line 49 */
#define EXTI_RTEN2_RTEN50              BIT(8)                   /*!< rising edge from line 50 */
#define EXTI_RTEN2_RTEN51              BIT(9)                   /*!< rising edge from line 51 */
#define EXTI_RTEN2_RTEN52              BIT(10)                  /*!< rising edge from line 52 */
#define EXTI_RTEN2_RTEN53              BIT(11)                  /*!< rising edge from line 53 */
#define EXTI_RTEN2_RTEN54              BIT(12)                  /*!< rising edge from line 54 */
#define EXTI_RTEN2_RTEN55              BIT(13)                  /*!< rising edge from line 55 */
#define EXTI_RTEN2_RTEN56              BIT(14)                  /*!< rising edge from line 56 */
#define EXTI_RTEN2_RTEN57              BIT(15)                  /*!< rising edge from line 57 */
#define EXTI_RTEN2_RTEN58              BIT(16)                  /*!< rising edge from line 58 */
#define EXTI_RTEN2_RTEN59              BIT(17)                  /*!< rising edge from line 59 */
#define EXTI_RTEN2_RTEN60              BIT(18)                  /*!< rising edge from line 60 */
#define EXTI_RTEN2_RTEN61              BIT(19)                  /*!< rising edge from line 61 */
#define EXTI_RTEN2_RTEN62              BIT(20)                  /*!< rising edge from line 62 */
#define EXTI_RTEN2_RTEN63              BIT(21)                  /*!< rising edge from line 63 */
#define EXTI_RTEN2_RTEN64              BIT(22)                  /*!< rising edge from line 64 */
#define EXTI_RTEN2_RTEN65              BIT(23)                  /*!< rising edge from line 65 */
#define EXTI_RTEN2_RTEN66              BIT(24)                  /*!< rising edge from line 66 */
#define EXTI_RTEN2_RTEN67              BIT(25)                  /*!< rising edge from line 67 */
#define EXTI_RTEN2_RTEN68              BIT(26)                  /*!< rising edge from line 68 */
#define EXTI_RTEN2_RTEN69              BIT(27)                  /*!< rising edge from line 69 */
#define EXTI_RTEN2_RTEN70              BIT(28)                  /*!< rising edge from line 70 */
#define EXTI_RTEN2_RTEN71              BIT(29)                  /*!< rising edge from line 71 */
#define EXTI_RTEN2_RTEN72              BIT(30)                  /*!< rising edge from line 72 */
#define EXTI_RTEN2_RTEN73              BIT(31)                  /*!< rising edge from line 73 */

/* EXTI_FTEN2 */
#define EXTI_FTEN2_FTEN42              BIT(0)                   /*!< falling edge from line 42 */
#define EXTI_FTEN2_FTEN43              BIT(1)                   /*!< falling edge from line 43 */
#define EXTI_FTEN2_FTEN44              BIT(2)                   /*!< falling edge from line 44 */
#define EXTI_FTEN2_FTEN45              BIT(3)                   /*!< falling edge from line 45 */
#define EXTI_FTEN2_FTEN46              BIT(4)                   /*!< falling edge from line 46 */
#define EXTI_FTEN2_FTEN47              BIT(5)                   /*!< falling edge from line 47 */
#define EXTI_FTEN2_FTEN48              BIT(6)                   /*!< falling edge from line 48 */
#define EXTI_FTEN2_FTEN49              BIT(7)                   /*!< falling edge from line 49 */
#define EXTI_FTEN2_FTEN50              BIT(8)                   /*!< falling edge from line 50 */
#define EXTI_FTEN2_FTEN51              BIT(9)                   /*!< falling edge from line 51 */
#define EXTI_FTEN2_FTEN52              BIT(10)                  /*!< falling edge from line 52 */
#define EXTI_FTEN2_FTEN53              BIT(11)                  /*!< falling edge from line 53 */
#define EXTI_FTEN2_FTEN54              BIT(12)                  /*!< falling edge from line 54 */
#define EXTI_FTEN2_FTEN55              BIT(13)                  /*!< falling edge from line 55 */
#define EXTI_FTEN2_FTEN56              BIT(14)                  /*!< falling edge from line 56 */
#define EXTI_FTEN2_FTEN57              BIT(15)                  /*!< falling edge from line 57 */
#define EXTI_FTEN2_FTEN58              BIT(16)                  /*!< falling edge from line 58 */
#define EXTI_FTEN2_FTEN59              BIT(17)                  /*!< falling edge from line 59 */
#define EXTI_FTEN2_FTEN60              BIT(18)                  /*!< falling edge from line 60 */
#define EXTI_FTEN2_FTEN61              BIT(19)                  /*!< falling edge from line 61 */
#define EXTI_FTEN2_FTEN62              BIT(20)                  /*!< falling edge from line 62 */
#define EXTI_FTEN2_FTEN63              BIT(21)                  /*!< falling edge from line 63 */
#define EXTI_FTEN2_FTEN64              BIT(22)                  /*!< falling edge from line 64 */
#define EXTI_FTEN2_FTEN65              BIT(23)                  /*!< falling edge from line 65 */
#define EXTI_FTEN2_FTEN66              BIT(24)                  /*!< falling edge from line 66 */
#define EXTI_FTEN2_FTEN67              BIT(25)                  /*!< falling edge from line 67 */
#define EXTI_FTEN2_FTEN68              BIT(26)                  /*!< falling edge from line 68 */
#define EXTI_FTEN2_FTEN69              BIT(27)                  /*!< falling edge from line 69 */
#define EXTI_FTEN2_FTEN70              BIT(28)                  /*!< falling edge from line 70 */
#define EXTI_FTEN2_FTEN71              BIT(29)                  /*!< falling edge from line 71 */
#define EXTI_FTEN2_FTEN72              BIT(30)                  /*!< falling edge from line 72 */
#define EXTI_FTEN2_FTEN73              BIT(31)                  /*!< falling edge from line 73 */

