sorosaulong-ux/gd32-test-project/Library/gd32a7xx_exti.h
/* EXTI_SWIEV2 */
#define EXTI_SWIEV2_SWIEV42            BIT(0)                   /*!< software interrupt/event request from line 42 */
#define EXTI_SWIEV2_SWIEV43            BIT(1)                   /*!< software interrupt/event request from line 43 */
#define EXTI_SWIEV2_SWIEV44            BIT(2)                   /*!< software interrupt/event request from line 44 */
#define EXTI_SWIEV2_SWIEV45            BIT(3)                   /*!< software interrupt/event request from line 45 */
#define EXTI_SWIEV2_SWIEV46            BIT(4)                   /*!< software interrupt/event request from line 46 */
#define EXTI_SWIEV2_SWIEV47            BIT(5)                   /*!< software interrupt/event request from line 47 */
#define EXTI_SWIEV2_SWIEV48            BIT(6)                   /*!< software interrupt/event request from line 48 */
#define EXTI_SWIEV2_SWIEV49            BIT(7)                   /*!< software interrupt/event request from line 49 */
#define EXTI_SWIEV2_SWIEV50            BIT(8)                   /*!< software interrupt/event request from line 50 */
#define EXTI_SWIEV2_SWIEV51            BIT(9)                   /*!< software interrupt/event request from line 51 */
#define EXTI_SWIEV2_SWIEV52            BIT(10)                  /*!< software interrupt/event request from line 52 */
#define EXTI_SWIEV2_SWIEV53            BIT(11)                  /*!< software interrupt/event request from line 53 */
#define EXTI_SWIEV2_SWIEV54            BIT(12)                  /*!< software interrupt/event request from line 54 */
#define EXTI_SWIEV2_SWIEV55            BIT(13)                  /*!< software interrupt/event request from line 55 */
#define EXTI_SWIEV2_SWIEV56            BIT(14)                  /*!< software interrupt/event request from line 56 */
#define EXTI_SWIEV2_SWIEV57            BIT(15)                  /*!< software interrupt/event request from line 57 */
#define EXTI_SWIEV2_SWIEV58            BIT(16)                  /*!< software interrupt/event request from line 58 */
#define EXTI_SWIEV2_SWIEV59            BIT(17)                  /*!< software interrupt/event request from line 59 */
#define EXTI_SWIEV2_SWIEV60            BIT(18)                  /*!< software interrupt/event request from line 60 */
#define EXTI_SWIEV2_SWIEV61            BIT(19)                  /*!< software interrupt/event request from line 61 */
#define EXTI_SWIEV2_SWIEV62            BIT(20)                  /*!< software interrupt/event request from line 62 */
#define EXTI_SWIEV2_SWIEV63            BIT(21)                  /*!< software interrupt/event request from line 63 */
#define EXTI_SWIEV2_SWIEV64            BIT(22)                  /*!< software interrupt/event request from line 64 */
#define EXTI_SWIEV2_SWIEV65            BIT(23)                  /*!< software interrupt/event request from line 65 */
#define EXTI_SWIEV2_SWIEV66            BIT(24)                  /*!< software interrupt/event request from line 66 */
#define EXTI_SWIEV2_SWIEV67            BIT(25)                  /*!< software interrupt/event request from line 67 */
#define EXTI_SWIEV2_SWIEV68            BIT(26)                  /*!< software interrupt/event request from line 68 */
#define EXTI_SWIEV2_SWIEV69            BIT(27)                  /*!< software interrupt/event request from line 69 */
#define EXTI_SWIEV2_SWIEV70            BIT(28)                  /*!< software interrupt/event request from line 70 */
#define EXTI_SWIEV2_SWIEV71            BIT(29)                  /*!< software interrupt/event request from line 71 */
#define EXTI_SWIEV2_SWIEV72            BIT(30)                  /*!< software interrupt/event request from line 72 */
#define EXTI_SWIEV2_SWIEV73            BIT(31)                  /*!< software interrupt/event request from line 73 */

/* EXTI_PD2 */
#define EXTI_PD2_PD42                  BIT(0)                   /*!< interrupt/event pending status from line 42 */
#define EXTI_PD2_PD43                  BIT(1)                   /*!< interrupt/event pending status from line 43 */
#define EXTI_PD2_PD44                  BIT(2)                   /*!< interrupt/event pending status from line 44 */
#define EXTI_PD2_PD45                  BIT(3)                   /*!< interrupt/event pending status from line 45 */
#define EXTI_PD2_PD46                  BIT(4)                   /*!< interrupt/event pending status from line 46 */
#define EXTI_PD2_PD47                  BIT(5)                   /*!< interrupt/event pending status from line 47 */
#define EXTI_PD2_PD48                  BIT(6)                   /*!< interrupt/event pending status from line 48 */
#define EXTI_PD2_PD49                  BIT(7)                   /*!< interrupt/event pending status from line 49 */
#define EXTI_PD2_PD50                  BIT(8)                   /*!< interrupt/event pending status from line 50 */
#define EXTI_PD2_PD51                  BIT(9)                   /*!< interrupt/event pending status from line 51 */
#define EXTI_PD2_PD52                  BIT(10)                  /*!< interrupt/event pending status from line 52 */
#define EXTI_PD2_PD53                  BIT(11)                  /*!< interrupt/event pending status from line 53 */
#define EXTI_PD2_PD54                  BIT(12)                  /*!< interrupt/event pending status from line 54 */
#define EXTI_PD2_PD55                  BIT(13)                  /*!< interrupt/event pending status from line 55 */
#define EXTI_PD2_PD56                  BIT(14)                  /*!< interrupt/event pending status from line 56 */
#define EXTI_PD2_PD57                  BIT(15)                  /*!< interrupt/event pending status from line 57 */
#define EXTI_PD2_PD58                  BIT(16)                  /*!< interrupt/event pending status from line 58 */
#define EXTI_PD2_PD59                  BIT(17)                  /*!< interrupt/event pending status from line 59 */
#define EXTI_PD2_PD60                  BIT(18)                  /*!< interrupt/event pending status from line 60 */
#define EXTI_PD2_PD61                  BIT(19)                  /*!< interrupt/event pending status from line 61 */
#define EXTI_PD2_PD62                  BIT(20)                  /*!< interrupt/event pending status from line 62 */
#define EXTI_PD2_PD63                  BIT(21)                  /*!< interrupt/event pending status from line 63 */
#define EXTI_PD2_PD64                  BIT(22)                  /*!< interrupt/event pending status from line 64 */
#define EXTI_PD2_PD65                  BIT(23)                  /*!< interrupt/event pending status from line 65 */
#define EXTI_PD2_PD66                  BIT(24)                  /*!< interrupt/event pending status from line 66 */
#define EXTI_PD2_PD67                  BIT(25)                  /*!< interrupt/event pending status from line 67 */
#define EXTI_PD2_PD68                  BIT(26)                  /*!< interrupt/event pending status from line 68 */
#define EXTI_PD2_PD69                  BIT(27)                  /*!< interrupt/event pending status from line 69 */
#define EXTI_PD2_PD70                  BIT(28)                  /*!< interrupt/event pending status from line 70 */
#define EXTI_PD2_PD71                  BIT(29)                  /*!< interrupt/event pending status from line 71 */
#define EXTI_PD2_PD72                  BIT(30)                  /*!< interrupt/event pending status from line 72 */
#define EXTI_PD2_PD73                  BIT(31)                  /*!< interrupt/event pending status from line 73 */

/* EXTI_INTEN3 */
#define EXTI_INTEN3_INTEN74            BIT(0)                   /*!< interrupt from line 74 */
#define EXTI_INTEN3_INTEN75            BIT(1)                   /*!< interrupt from line 75 */
#define EXTI_INTEN3_INTEN76            BIT(2)                   /*!< interrupt from line 76 */
#define EXTI_INTEN3_INTEN77            BIT(3)                   /*!< interrupt from line 77 */
#define EXTI_INTEN3_INTEN78            BIT(4)                   /*!< interrupt from line 78 */
#define EXTI_INTEN3_INTEN79            BIT(5)                   /*!< interrupt from line 79 */
#define EXTI_INTEN3_INTEN80            BIT(6)                   /*!< interrupt from line 80 */
#define EXTI_INTEN3_INTEN81            BIT(7)                   /*!< interrupt from line 81 */
#define EXTI_INTEN3_INTEN82            BIT(8)                   /*!< interrupt from line 82 */
#define EXTI_INTEN3_INTEN83            BIT(9)                   /*!< interrupt from line 83 */
#define EXTI_INTEN3_INTEN84            BIT(10)                  /*!< interrupt from line 84 */
#define EXTI_INTEN3_INTEN85            BIT(11)                  /*!< interrupt from line 85 */
#define EXTI_INTEN3_INTEN86            BIT(12)                  /*!< interrupt from line 86 */
#define EXTI_INTEN3_INTEN87            BIT(13)                  /*!< interrupt from line 87 */
#define EXTI_INTEN3_INTEN88            BIT(14)                  /*!< interrupt from line 88 */
#define EXTI_INTEN3_INTEN89            BIT(15)                  /*!< interrupt from line 89 */
#define EXTI_INTEN3_INTEN90            BIT(16)                  /*!< interrupt from line 90 */
#define EXTI_INTEN3_INTEN91            BIT(17)                  /*!< interrupt from line 91 */
#define EXTI_INTEN3_INTEN92            BIT(18)                  /*!< interrupt from line 92 */
#define EXTI_INTEN3_INTEN93            BIT(19)                  /*!< interrupt from line 93 */
#define EXTI_INTEN3_INTEN94            BIT(20)                  /*!< interrupt from line 94 */
#define EXTI_INTEN3_INTEN95            BIT(21)                  /*!< interrupt from line 95 */
#define EXTI_INTEN3_INTEN96            BIT(22)                  /*!< interrupt from line 96 */
#define EXTI_INTEN3_INTEN97            BIT(23)                  /*!< interrupt from line 97 */
#define EXTI_INTEN3_INTEN98            BIT(24)                  /*!< interrupt from line 98 */
#define EXTI_INTEN3_INTEN99            BIT(25)                  /*!< interrupt from line 99 */
#define EXTI_INTEN3_INTEN100           BIT(26)                  /*!< interrupt from line 100 */
#define EXTI_INTEN3_INTEN101           BIT(27)                  /*!< interrupt from line 101 */

/* EXTI_EVEN3 */
#define EXTI_EVEN3_EVEN74             BIT(0)                   /*!< event from line 74 */
#define EXTI_EVEN3_EVEN75             BIT(1)                   /*!< event from line 75 */
#define EXTI_EVEN3_EVEN76             BIT(2)                   /*!< event from line 76 */
#define EXTI_EVEN3_EVEN77             BIT(3)                   /*!< event from line 77 */
#define EXTI_EVEN3_EVEN78             BIT(4)                   /*!< event from line 78 */
#define EXTI_EVEN3_EVEN79             BIT(5)                   /*!< event from line 79 */
#define EXTI_EVEN3_EVEN80             BIT(6)                   /*!< event from line 80 */
#define EXTI_EVEN3_EVEN81             BIT(7)                   /*!< event from line 81 */
#define EXTI_EVEN3_EVEN82             BIT(8)                   /*!< event from line 82 */
#define EXTI_EVEN3_EVEN83             BIT(9)                   /*!< event from line 83 */
#define EXTI_EVEN3_EVEN84             BIT(10)                  /*!< event from line 84 */
#define EXTI_EVEN3_EVEN85             BIT(11)                  /*!< event from line 85 */
#define EXTI_EVEN3_EVEN86             BIT(12)                  /*!< event from line 86 */
#define EXTI_EVEN3_EVEN87             BIT(13)                  /*!< event from line 87 */
#define EXTI_EVEN3_EVEN88             BIT(14)                  /*!< event from line 88 */
#define EXTI_EVEN3_EVEN89             BIT(15)                  /*!< event from line 89 */
#define EXTI_EVEN3_EVEN90             BIT(16)                  /*!< event from line 90 */
#define EXTI_EVEN3_EVEN91             BIT(17)                  /*!< event from line 91 */
#define EXTI_EVEN3_EVEN92             BIT(18)                  /*!< event from line 92 */
#define EXTI_EVEN3_EVEN93             BIT(19)                  /*!< event from line 93 */
#define EXTI_EVEN3_EVEN94             BIT(20)                  /*!< event from line 94 */
#define EXTI_EVEN3_EVEN95             BIT(21)                  /*!< event from line 95 */
#define EXTI_EVEN3_EVEN96             BIT(22)                  /*!< event from line 96 */
#define EXTI_EVEN3_EVEN97             BIT(23)                  /*!< event from line 97 */
#define EXTI_EVEN3_EVEN98             BIT(24)                  /*!< event from line 98 */
#define EXTI_EVEN3_EVEN99             BIT(25)                  /*!< event from line 99 */
#define EXTI_EVEN3_EVEN100            BIT(26)                  /*!< event from line 100 */
#define EXTI_EVEN3_EVEN101            BIT(27)                  /*!< event from line 101 */

/* EXTI_RTEN3 */
#define EXTI_RTEN3_RTEN74             BIT(0)                   /*!< rising edge from line 74 */
#define EXTI_RTEN3_RTEN75             BIT(1)                   /*!< rising edge from line 75 */
#define EXTI_RTEN3_RTEN76             BIT(2)                   /*!< rising edge from line 76 */
#define EXTI_RTEN3_RTEN77             BIT(3)                   /*!< rising edge from line 77 */
#define EXTI_RTEN3_RTEN78             BIT(4)                   /*!< rising edge from line 78 */
#define EXTI_RTEN3_RTEN79             BIT(5)                   /*!< rising edge from line 79 */
#define EXTI_RTEN3_RTEN80             BIT(6)                   /*!< rising edge from line 80 */
#define EXTI_RTEN3_RTEN81             BIT(7)                   /*!< rising edge from line 81 */
#define EXTI_RTEN3_RTEN82             BIT(8)                   /*!< rising edge from line 82 */
#define EXTI_RTEN3_RTEN83             BIT(9)                   /*!< rising edge from line 83 */
#define EXTI_RTEN3_RTEN84             BIT(10)                  /*!< rising edge from line 84 */
#define EXTI_RTEN3_RTEN85             BIT(11)                  /*!< rising edge from line 85 */
#define EXTI_RTEN3_RTEN86             BIT(12)                  /*!< rising edge from line 86 */
#define EXTI_RTEN3_RTEN87             BIT(13)                  /*!< rising edge from line 87 */
#define EXTI_RTEN3_RTEN88             BIT(14)                  /*!< rising edge from line 88 */
#define EXTI_RTEN3_RTEN89             BIT(15)                  /*!< rising edge from line 89 */
#define EXTI_RTEN3_RTEN90             BIT(16)                  /*!< rising edge from line 90 */
#define EXTI_RTEN3_RTEN91             BIT(17)                  /*!< rising edge from line 91 */
#define EXTI_RTEN3_RTEN92             BIT(18)                  /*!< rising edge from line 92 */
#define EXTI_RTEN3_RTEN93             BIT(19)                  /*!< rising edge from line 93 */
#define EXTI_RTEN3_RTEN94             BIT(20)                  /*!< rising edge from line 94 */
#define EXTI_RTEN3_RTEN95             BIT(21)                  /*!< rising edge from line 95 */
#define EXTI_RTEN3_RTEN96             BIT(22)                  /*!< rising edge from line 96 */
#define EXTI_RTEN3_RTEN97             BIT(23)                  /*!< rising edge from line 97 */
#define EXTI_RTEN3_RTEN98             BIT(24)                  /*!< rising edge from line 98 */
#define EXTI_RTEN3_RTEN99             BIT(25)                  /*!< rising edge from line 99 */
#define EXTI_RTEN3_RTEN100            BIT(26)                  /*!< rising edge from line 100 */
#define EXTI_RTEN3_RTEN101            BIT(27)                  /*!< rising edge from line 101 */

