sorosaulong-ux/gd32-test-project/Library/gd32a7xx_exti.h
/* EXTI_FTEN3 */
#define EXTI_FTEN3_FTEN74             BIT(0)                   /*!< falling edge from line 74 */
#define EXTI_FTEN3_FTEN75             BIT(1)                   /*!< falling edge from line 75 */
#define EXTI_FTEN3_FTEN76             BIT(2)                   /*!< falling edge from line 76 */
#define EXTI_FTEN3_FTEN77             BIT(3)                   /*!< falling edge from line 77 */
#define EXTI_FTEN3_FTEN78             BIT(4)                   /*!< falling edge from line 78 */
#define EXTI_FTEN3_FTEN79             BIT(5)                   /*!< falling edge from line 79 */
#define EXTI_FTEN3_FTEN80             BIT(6)                   /*!< falling edge from line 80 */
#define EXTI_FTEN3_FTEN81             BIT(7)                   /*!< falling edge from line 81 */
#define EXTI_FTEN3_FTEN82             BIT(8)                   /*!< falling edge from line 82 */
#define EXTI_FTEN3_FTEN83             BIT(9)                   /*!< falling edge from line 83 */
#define EXTI_FTEN3_FTEN84             BIT(10)                  /*!< falling edge from line 84 */
#define EXTI_FTEN3_FTEN85             BIT(11)                  /*!< falling edge from line 85 */
#define EXTI_FTEN3_FTEN86             BIT(12)                  /*!< falling edge from line 86 */
#define EXTI_FTEN3_FTEN87             BIT(13)                  /*!< falling edge from line 87 */
#define EXTI_FTEN3_FTEN88             BIT(14)                  /*!< falling edge from line 88 */
#define EXTI_FTEN3_FTEN89             BIT(15)                  /*!< falling edge from line 89 */
#define EXTI_FTEN3_FTEN90             BIT(16)                  /*!< falling edge from line 90 */
#define EXTI_FTEN3_FTEN91             BIT(17)                  /*!< falling edge from line 91 */
#define EXTI_FTEN3_FTEN92             BIT(18)                  /*!< falling edge from line 92 */
#define EXTI_FTEN3_FTEN93             BIT(19)                  /*!< falling edge from line 93 */
#define EXTI_FTEN3_FTEN94             BIT(20)                  /*!< falling edge from line 94 */
#define EXTI_FTEN3_FTEN95             BIT(21)                  /*!< falling edge from line 95 */
#define EXTI_FTEN3_FTEN96             BIT(22)                  /*!< falling edge from line 96 */
#define EXTI_FTEN3_FTEN97             BIT(23)                  /*!< falling edge from line 97 */
#define EXTI_FTEN3_FTEN98             BIT(24)                  /*!< falling edge from line 98 */
#define EXTI_FTEN3_FTEN99             BIT(25)                  /*!< falling edge from line 99 */
#define EXTI_FTEN3_FTEN100            BIT(26)                  /*!< falling edge from line 100 */
#define EXTI_FTEN3_FTEN101            BIT(27)                  /*!< falling edge from line 101 */

/* EXTI_SWIEV3 */
#define EXTI_SWIEV3_SWIEV74           BIT(0)                   /*!< software interrupt/event request from line 74 */
#define EXTI_SWIEV3_SWIEV75           BIT(1)                   /*!< software interrupt/event request from line 75 */
#define EXTI_SWIEV3_SWIEV76           BIT(2)                   /*!< software interrupt/event request from line 76 */
#define EXTI_SWIEV3_SWIEV77           BIT(3)                   /*!< software interrupt/event request from line 77 */
#define EXTI_SWIEV3_SWIEV78           BIT(4)                   /*!< software interrupt/event request from line 78 */
#define EXTI_SWIEV3_SWIEV79           BIT(5)                   /*!< software interrupt/event request from line 79 */
#define EXTI_SWIEV3_SWIEV80           BIT(6)                   /*!< software interrupt/event request from line 80 */
#define EXTI_SWIEV3_SWIEV81           BIT(7)                   /*!< software interrupt/event request from line 81 */
#define EXTI_SWIEV3_SWIEV82           BIT(8)                   /*!< software interrupt/event request from line 82 */
#define EXTI_SWIEV3_SWIEV83           BIT(9)                   /*!< software interrupt/event request from line 83 */
#define EXTI_SWIEV3_SWIEV84           BIT(10)                  /*!< software interrupt/event request from line 84 */
#define EXTI_SWIEV3_SWIEV85           BIT(11)                  /*!< software interrupt/event request from line 85 */
#define EXTI_SWIEV3_SWIEV86           BIT(12)                  /*!< software interrupt/event request from line 86 */
#define EXTI_SWIEV3_SWIEV87           BIT(13)                  /*!< software interrupt/event request from line 87 */
#define EXTI_SWIEV3_SWIEV88           BIT(14)                  /*!< software interrupt/event request from line 88 */
#define EXTI_SWIEV3_SWIEV89           BIT(15)                  /*!< software interrupt/event request from line 89 */
#define EXTI_SWIEV3_SWIEV90           BIT(16)                  /*!< software interrupt/event request from line 90 */
#define EXTI_SWIEV3_SWIEV91           BIT(17)                  /*!< software interrupt/event request from line 91 */
#define EXTI_SWIEV3_SWIEV92           BIT(18)                  /*!< software interrupt/event request from line 92 */
#define EXTI_SWIEV3_SWIEV93           BIT(19)                  /*!< software interrupt/event request from line 93 */
#define EXTI_SWIEV3_SWIEV94           BIT(20)                  /*!< software interrupt/event request from line 94 */
#define EXTI_SWIEV3_SWIEV95           BIT(21)                  /*!< software interrupt/event request from line 95 */
#define EXTI_SWIEV3_SWIEV96           BIT(22)                  /*!< software interrupt/event request from line 96 */
#define EXTI_SWIEV3_SWIEV97           BIT(23)                  /*!< software interrupt/event request from line 97 */
#define EXTI_SWIEV3_SWIEV98           BIT(24)                  /*!< software interrupt/event request from line 98 */
#define EXTI_SWIEV3_SWIEV99           BIT(25)                  /*!< software interrupt/event request from line 99 */
#define EXTI_SWIEV3_SWIEV100          BIT(26)                  /*!< software interrupt/event request from line 100 */
#define EXTI_SWIEV3_SWIEV101          BIT(27)                  /*!< software interrupt/event request from line 101 */

/* EXTI_PD3 */
#define EXTI_PD3_PD74                 BIT(0)                   /*!< interrupt/event pending status from line 74 */
#define EXTI_PD3_PD75                 BIT(1)                   /*!< interrupt/event pending status from line 75 */
#define EXTI_PD3_PD76                 BIT(2)                   /*!< interrupt/event pending status from line 76 */
#define EXTI_PD3_PD77                 BIT(3)                   /*!< interrupt/event pending status from line 77 */
#define EXTI_PD3_PD78                 BIT(4)                   /*!< interrupt/event pending status from line 78 */
#define EXTI_PD3_PD79                 BIT(5)                   /*!< interrupt/event pending status from line 79 */
#define EXTI_PD3_PD80                 BIT(6)                   /*!< interrupt/event pending status from line 80 */
#define EXTI_PD3_PD81                 BIT(7)                   /*!< interrupt/event pending status from line 81 */
#define EXTI_PD3_PD82                 BIT(8)                   /*!< interrupt/event pending status from line 82 */
#define EXTI_PD3_PD83                 BIT(9)                   /*!< interrupt/event pending status from line 83 */
#define EXTI_PD3_PD84                 BIT(10)                  /*!< interrupt/event pending status from line 84 */
#define EXTI_PD3_PD85                 BIT(11)                  /*!< interrupt/event pending status from line 85 */
#define EXTI_PD3_PD86                 BIT(12)                  /*!< interrupt/event pending status from line 86 */
#define EXTI_PD3_PD87                 BIT(13)                  /*!< interrupt/event pending status from line 87 */
#define EXTI_PD3_PD88                 BIT(14)                  /*!< interrupt/event pending status from line 88 */
#define EXTI_PD3_PD89                 BIT(15)                  /*!< interrupt/event pending status from line 89 */
#define EXTI_PD3_PD90                 BIT(16)                  /*!< interrupt/event pending status from line 90 */
#define EXTI_PD3_PD91                 BIT(17)                  /*!< interrupt/event pending status from line 91 */
#define EXTI_PD3_PD92                 BIT(18)                  /*!< interrupt/event pending status from line 92 */
#define EXTI_PD3_PD93                 BIT(19)                  /*!< interrupt/event pending status from line 93 */
#define EXTI_PD3_PD94                 BIT(20)                  /*!< interrupt/event pending status from line 94 */
#define EXTI_PD3_PD95                 BIT(21)                  /*!< interrupt/event pending status from line 95 */
#define EXTI_PD3_PD96                 BIT(22)                  /*!< interrupt/event pending status from line 96 */
#define EXTI_PD3_PD97                 BIT(23)                  /*!< interrupt/event pending status from line 97 */
#define EXTI_PD3_PD98                 BIT(24)                  /*!< interrupt/event pending status from line 98 */
#define EXTI_PD3_PD99                 BIT(25)                  /*!< interrupt/event pending status from line 99 */
#define EXTI_PD3_PD100                BIT(26)                  /*!< interrupt/event pending status from line 100 */
#define EXTI_PD3_PD101                BIT(27)                  /*!< interrupt/event pending status from line 101 */

/* constants definitions */
/* define the EXTI bit position and its register group index offset */
#define EXTI_GROUPIDX_BIT(groupidx, bit)        (((uint32_t)(groupidx) << 8) | (uint32_t)(bit))                
#define EXTI_REG_VAL(linex)                     (EXTI + ((uint32_t)(linex) >> 8))              
#define EXTI_BIT_POS(linex)                     BIT((linex) & 0x1FU)                                          

/* define the EXTI register groups*/
#define EXTI_GROUP0_OFFSET                      (0x00U)                                             /*!< the index offset of EXTI group0 */
#define EXTI_GROUP1_OFFSET                      (0x18U)                                             /*!< the index offset of EXTI group1 */
#define EXTI_GROUP2_OFFSET                      (0x30U)                                             /*!< the index offset of EXTI group2 */
#define EXTI_GROUP3_OFFSET                      (0x48U)                                             /*!< the index offset of EXTI group3 */

/* define the registers in the group*/
#define EXTI_INTEN(exti_group)                   REG32((uint32_t)(exti_group) + 0x00000000U)        /*!< the index offset of register INTEN in the register group */
#define EXTI_EVEN(exti_group)                    REG32((uint32_t)(exti_group) + 0x00000004U)        /*!< the index offset of register EVEN in the register group */
#define EXTI_RTEN(exti_group)                    REG32((uint32_t)(exti_group) + 0x00000008U)        /*!< the index offset of register RTEN in the register group */
#define EXTI_FTEN(exti_group)                    REG32((uint32_t)(exti_group) + 0x0000000CU)        /*!< the index offset of register FTEN in the register group */
#define EXTI_SWIEV(exti_group)                   REG32((uint32_t)(exti_group) + 0x00000010U)        /*!< the index offset of register SWIEV in the register group */
#define EXTI_PD(exti_group)                      REG32((uint32_t)(exti_group) + 0x00000014U)        /*!< the index offset of register PD in the register group */

/* EXTI line number */
typedef enum
{
    EXTI_0      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 0U),    /*!< EXTI line 0 */
    EXTI_1      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 1U),    /*!< EXTI line 1 */
    EXTI_2      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 2U),    /*!< EXTI line 2 */
    EXTI_3      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 3U),    /*!< EXTI line 3 */
    EXTI_4      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 4U),    /*!< EXTI line 4 */
    EXTI_5      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 5U),    /*!< EXTI line 5 */
    EXTI_6      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 6U),    /*!< EXTI line 6 */
    EXTI_7      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 7U),    /*!< EXTI line 7 */
    EXTI_8      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 8U),    /*!< EXTI line 8 */
    EXTI_9      = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 9U),    /*!< EXTI line 9 */
    EXTI_10     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 10U),   /*!< EXTI line 10 */
    EXTI_11     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 11U),   /*!< EXTI line 11 */
    EXTI_12     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 12U),   /*!< EXTI line 12 */
    EXTI_13     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 13U),   /*!< EXTI line 13 */
    EXTI_14     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 14U),   /*!< EXTI line 14 */
    EXTI_15     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 15U),   /*!< EXTI line 15 */
    EXTI_16     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 16U),   /*!< EXTI line 16 */
    EXTI_17     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 17U),   /*!< EXTI line 17 */
    EXTI_18     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 18U),   /*!< EXTI line 18 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    EXTI_19     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 19U),   /*!< EXTI line 19 */
    EXTI_20     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 20U),   /*!< EXTI line 20 */
    EXTI_21     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 21U),   /*!< EXTI line 21 */
    EXTI_22     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 22U),   /*!< EXTI line 22 */
    EXTI_23     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 23U),   /*!< EXTI line 23 */
    EXTI_24     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 24U),   /*!< EXTI line 24 */
    EXTI_25     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 25U),   /*!< EXTI line 25 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    EXTI_26     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 26U),   /*!< EXTI line 26 */
    EXTI_27     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 27U),   /*!< EXTI line 27 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    EXTI_28     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 28U),   /*!< EXTI line 28 */
    EXTI_29     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 29U),   /*!< EXTI line 29 */
    EXTI_30     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 30U),   /*!< EXTI line 30 */
    EXTI_31     = EXTI_GROUPIDX_BIT(EXTI_GROUP0_OFFSET, 31U),   /*!< EXTI line 31 */
    EXTI_32     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 0U),    /*!< EXTI line 32 */
    EXTI_33     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 1U),    /*!< EXTI line 33 */
    EXTI_34     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 2U),    /*!< EXTI line 34 */
    EXTI_35     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 3U),    /*!< EXTI line 35 */
    EXTI_36     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 4U),    /*!< EXTI line 36 */
    EXTI_37     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 5U),    /*!< EXTI line 37 */
    EXTI_38     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 6U),    /*!< EXTI line 38 */
    EXTI_39     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 7U),    /*!< EXTI line 39 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    EXTI_40     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 8U),    /*!< EXTI line 40 */
    EXTI_41     = EXTI_GROUPIDX_BIT(EXTI_GROUP1_OFFSET, 9U),    /*!< EXTI line 41 */
    EXTI_42     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 0U),    /*!< EXTI line 42 */
    EXTI_43     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 1U),    /*!< EXTI line 43 */
    EXTI_44     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 2U),    /*!< EXTI line 44 */
    EXTI_45     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 3U),    /*!< EXTI line 45 */
    EXTI_46     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 4U),    /*!< EXTI line 46 */
    EXTI_47     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 5U),    /*!< EXTI line 47 */
    EXTI_48     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 6U),    /*!< EXTI line 48 */
    EXTI_49     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 7U),    /*!< EXTI line 49 */
    EXTI_50     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 8U),    /*!< EXTI line 50 */
    EXTI_51     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 9U),    /*!< EXTI line 51 */
    EXTI_52     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 10U),   /*!< EXTI line 52 */
    EXTI_53     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 11U),   /*!< EXTI line 53 */
    EXTI_54     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 12U),   /*!< EXTI line 54 */
    EXTI_55     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 13U),   /*!< EXTI line 55 */
    EXTI_56     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 14U),   /*!< EXTI line 56 */
    EXTI_57     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 15U),   /*!< EXTI line 57 */
    EXTI_58     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 16U),   /*!< EXTI line 58 */
    EXTI_59     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 17U),   /*!< EXTI line 59 */
    EXTI_60     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 18U),   /*!< EXTI line 60 */
    EXTI_61     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 19U),   /*!< EXTI line 61 */
    EXTI_62     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 20U),   /*!< EXTI line 62 */
    EXTI_63     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 21U),   /*!< EXTI line 63 */
    EXTI_64     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 22U),   /*!< EXTI line 64 */
    EXTI_65     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 23U),   /*!< EXTI line 65 */
    EXTI_66     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 24U),   /*!< EXTI line 66 */
    EXTI_67     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 25U),   /*!< EXTI line 67 */
    EXTI_68     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 26U),   /*!< EXTI line 68 */
    EXTI_69     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 27U),   /*!< EXTI line 69 */
    EXTI_70     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 28U),   /*!< EXTI line 70 */
    EXTI_71     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 29U),   /*!< EXTI line 71 */
    EXTI_72     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 30U),   /*!< EXTI line 72 */
    EXTI_73     = EXTI_GROUPIDX_BIT(EXTI_GROUP2_OFFSET, 31U),   /*!< EXTI line 73 */
    EXTI_74     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 0U),    /*!< EXTI line 74 */
    EXTI_75     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 1U),    /*!< EXTI line 75 */
    EXTI_76     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 2U),    /*!< EXTI line 76 */
    EXTI_77     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 3U),    /*!< EXTI line 77 */
    EXTI_78     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 4U),    /*!< EXTI line 78 */
    EXTI_79     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 5U),    /*!< EXTI line 79 */
    EXTI_80     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 6U),    /*!< EXTI line 80 */
    EXTI_81     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 7U),    /*!< EXTI line 81 */
    EXTI_82     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 8U),    /*!< EXTI line 82 */
    EXTI_83     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 9U),    /*!< EXTI line 83 */
    EXTI_84     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 10U),   /*!< EXTI line 84 */
    EXTI_85     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 11U),   /*!< EXTI line 85 */
    EXTI_86     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 12U),   /*!< EXTI line 86 */
    EXTI_87     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 13U),   /*!< EXTI line 87 */
    EXTI_88     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 14U),   /*!< EXTI line 88 */
    EXTI_89     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 15U),   /*!< EXTI line 89 */
    EXTI_90     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 16U),   /*!< EXTI line 90 */
    EXTI_91     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 17U),   /*!< EXTI line 91 */
    EXTI_92     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 18U),   /*!< EXTI line 92 */
    EXTI_93     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 19U),   /*!< EXTI line 93 */
    EXTI_94     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 20U),   /*!< EXTI line 94 */
    EXTI_95     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 21U),   /*!< EXTI line 95 */
    EXTI_96     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 22U),   /*!< EXTI line 96 */
    EXTI_97     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 23U),   /*!< EXTI line 97 */
    EXTI_98     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 24U),   /*!< EXTI line 98 */
    EXTI_99     = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 25U),   /*!< EXTI line 99 */
    EXTI_100    = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 26U),   /*!< EXTI line 100 */
    EXTI_101    = EXTI_GROUPIDX_BIT(EXTI_GROUP3_OFFSET, 27U)    /*!< EXTI line 101 */
} exti_line_enum;

