sorosaulong-ux/gd32-test-project/Library/gd32a7xx_exti.h
/* external interrupt and event */
typedef enum
{
    EXTI_INTERRUPT   = 0U,                                      /*!< EXTI interrupt mode */
    EXTI_EVENT                                                  /*!< EXTI event mode */
} exti_mode_enum;
 
/* interrupt trigger mode */
typedef enum
{
    EXTI_TRIG_RISING = 0U,                                      /*!< EXTI rising edge trigger */
    EXTI_TRIG_FALLING,                                          /*!< EXTI falling edge trigger */
    EXTI_TRIG_BOTH,                                             /*!< EXTI rising and falling edge trigger */
    EXTI_TRIG_NONE                                              /*!< without rising edge or falling edge trigger */
} exti_trig_type_enum;

/* function declarations */
/* initialization, EXTI lines configuration functions */
/* deinitialize the EXTI */
void exti_deinit(void);
/* initialize the EXTI line x */
void exti_init(exti_line_enum linex, exti_mode_enum mode, exti_trig_type_enum trig_type);
/* enable the interrupts from EXTI line x */
void exti_interrupt_enable(exti_line_enum linex);
/* disable the interrupts from EXTI line x */
void exti_interrupt_disable(exti_line_enum linex);
/* enable the events from EXTI line x */
void exti_event_enable(exti_line_enum linex);
/* disable the events from EXTI line x */
void exti_event_disable(exti_line_enum linex);
/* enable the software interrupt event from EXTI line x */
void exti_software_interrupt_enable(exti_line_enum linex);
/* disable the software interrupt event from EXTI line x */
void exti_software_interrupt_disable(exti_line_enum linex);

/* interrupt & flag functions */
/* get EXTI line x pending flag */
FlagStatus exti_flag_get(exti_line_enum linex);
/* clear EXTI line x pending flag */
void exti_flag_clear(exti_line_enum linex);
/* get EXTI line x interrupt pending flag */
FlagStatus exti_interrupt_flag_get(exti_line_enum linex);
/* clear EXTI line x interrupt pending flag */
void exti_interrupt_flag_clear(exti_line_enum linex);

#endif /* GD32A7XX_EXTI_H */
